
# State **`s3://infrahouse-github-control-state/terraform.tfstate`**
## Affected resources counts

|  Success  |  Add   |  Change   |  Destroy   |
|:---------:|:-------|:----------|:-----------|
|     ✅     | ❔      | ❔         | ❔          |
## Affected resources by action

No affected resources
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # github_organization_settings.infrahouse will be updated in-place
  ~ resource "github_organization_settings" "infrahouse" {
      + billing_email                                                = "billing@infrahouse.com"
      + default_repository_permission                                = "read"
        id                                                           = "121984263"
        name                                                         = "InfraHouse"
        # (22 unchanged attributes hidden)
    }

  # module.ih8_tf_template.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
        id                          = "terraform-template"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "terraform-template"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        # (25 unchanged attributes hidden)
    }

  # module.ih_8_repos["github-control"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-03-20 14:48:39 +0000 UTC" -> (known after apply)
      ~ id              = "github-control:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-20 14:48:39 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.ih_8_repos["github-control"].github_branch_protection.main will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "R_kgDOI2vu7A"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + contexts = [
              + "Terraform Plan",
            ]
          + strict   = true
        }
    }

  # module.ih_8_repos["github-control"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "github-control"
        name                        = "github-control"
      ~ vulnerability_alerts        = false -> true
        # (33 unchanged attributes hidden)
    }

  # module.repos["aws-control"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-06-30 23:39:23 +0000 UTC" -> (known after apply)
      ~ id              = "aws-control:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-06-30 23:39:23 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["aws-control-289256138624"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-06-30 23:39:27 +0000 UTC" -> (known after apply)
      ~ id              = "aws-control-289256138624:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-06-30 23:39:27 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["aws-control-303467602807"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-06-30 23:39:28 +0000 UTC" -> (known after apply)
      ~ id              = "aws-control-303467602807:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-06-30 23:39:28 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["aws-control-493370826424"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-07-09 16:11:13 +0000 UTC" -> (known after apply)
      ~ id              = "aws-control-493370826424:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-07-09 16:11:13 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["cookiecutter-github-control"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-03-22 03:03:10 +0000 UTC" -> (known after apply)
      ~ id              = "cookiecutter-github-control:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-22 03:03:10 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["infrahouse-com"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-08-19 20:36:21 +0000 UTC" -> (known after apply)
      ~ id              = "infrahouse-com:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-08-19 20:36:21 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["infrahouse-puppet-data"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-11-08 13:02:45 +0000 UTC" -> (known after apply)
      ~ id              = "infrahouse-puppet-data:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-11-08 13:02:45 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["infrahouse-toolkit"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-03-22 03:03:01 +0000 UTC" -> (known after apply)
      ~ id              = "infrahouse-toolkit:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-22 03:03:01 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["infrahouse-website-infra"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-03-22 03:03:02 +0000 UTC" -> (known after apply)
      ~ id              = "infrahouse-website-infra:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-22 03:03:02 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["proxysql-sandbox"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-06-15 14:57:57 +0000 UTC" -> (known after apply)
      ~ id              = "proxysql-sandbox:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-06-15 14:57:57 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["puppet-code"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-08-03 15:39:14 +0000 UTC" -> (known after apply)
      ~ id              = "puppet-code:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-08-03 15:39:14 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-ci-cd"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-10-18 00:29:33 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-ci-cd:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-18 00:29:33 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-cloud-init"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-08-18 15:43:43 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-cloud-init:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-08-18 15:43:43 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-debian-repo"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-07-24 23:33:38 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-debian-repo:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-07-24 23:33:38 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-ecs"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-11-23 16:01:51 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-ecs:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-11-23 16:01:51 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-elasticsearch"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2024-02-05 17:31:01 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-elasticsearch:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-02-05 17:31:01 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-gh-identity-provider"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-07-03 23:05:00 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-gh-identity-provider:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-07-03 23:05:00 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-gha-admin"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-07-02 15:15:28 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-gha-admin:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-07-02 15:15:28 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-github-role"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-11-07 23:09:44 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-github-role:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-11-07 23:09:44 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-instance-profile"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-08-10 15:10:07 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-instance-profile:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-08-10 15:10:07 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-jumphost"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-11-01 16:16:00 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-jumphost:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-11-01 16:16:00 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-kibana"].github_actions_secret.secret["GH_TOKEN"] will be destroyed
  # (because module.repos["terraform-aws-kibana"] is not in configuration)
  - resource "github_actions_secret" "secret" {
      - created_at      = "2024-02-18 02:11:56 +0000 UTC" -> null
      - id              = "terraform-aws-kibana:GH_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "terraform-aws-kibana" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2024-02-18 02:11:56 +0000 UTC" -> null
    }

  # module.repos["terraform-aws-kibana"].github_repository.repo will be destroyed
  # (because module.repos["terraform-aws-kibana"] is not in configuration)
  - resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - description                 = "Module that deploys Kibana" -> null
      - etag                        = "W/\"65d7db5449f20f4037b8dfee952ed823f4942152e4c803789c27aeb0a1dde82a\"" -> null
      - full_name                   = "infrahouse/terraform-aws-kibana" -> null
      - git_clone_url               = "git://github.com/infrahouse/terraform-aws-kibana.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/infrahouse/terraform-aws-kibana" -> null
      - http_clone_url              = "https://github.com/infrahouse/terraform-aws-kibana.git" -> null
      - id                          = "terraform-aws-kibana" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "terraform-aws-kibana" -> null
      - node_id                     = "R_kgDOLUDwIQ" -> null
      - primary_language            = "HCL" -> null
      - private                     = false -> null
      - repo_id                     = 759230497 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:infrahouse/terraform-aws-kibana.git" -> null
      - svn_url                     = "https://github.com/infrahouse/terraform-aws-kibana" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
    }

  # module.repos["terraform-aws-kibana"].github_team_repository.dev will be destroyed
  # (because module.repos["terraform-aws-kibana"] is not in configuration)
  - resource "github_team_repository" "dev" {
      - etag       = "W/\"fc56a102e9abf38a27f4da924ea2c550054a653de5ae9dbc3e075ab9ba223db6\"" -> null
      - id         = "7332815:terraform-aws-kibana" -> null
      - permission = "push" -> null
      - repository = "terraform-aws-kibana" -> null
      - team_id    = "7332815" -> null
    }

  # module.repos["terraform-aws-pypiserver"].github_actions_secret.secret["GH_TOKEN"] will be destroyed
  # (because module.repos["terraform-aws-pypiserver"] is not in configuration)
  - resource "github_actions_secret" "secret" {
      - created_at      = "2024-02-20 20:53:05 +0000 UTC" -> null
      - id              = "terraform-aws-pypiserver:GH_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "terraform-aws-pypiserver" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2024-02-20 20:53:05 +0000 UTC" -> null
    }

  # module.repos["terraform-aws-pypiserver"].github_repository.repo will be destroyed
  # (because module.repos["terraform-aws-pypiserver"] is not in configuration)
  - resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - description                 = "Terraform module that deploys a private PyPI server." -> null
      - etag                        = "W/\"9c2e453ca996b48c81deafa605b559d3a1f18a361ca5a1f6b686c991d1c7b4d2\"" -> null
      - full_name                   = "infrahouse/terraform-aws-pypiserver" -> null
      - git_clone_url               = "git://github.com/infrahouse/terraform-aws-pypiserver.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/infrahouse/terraform-aws-pypiserver" -> null
      - http_clone_url              = "https://github.com/infrahouse/terraform-aws-pypiserver.git" -> null
      - id                          = "terraform-aws-pypiserver" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "terraform-aws-pypiserver" -> null
      - node_id                     = "R_kgDOLVojaQ" -> null
      - primary_language            = "HCL" -> null
      - private                     = false -> null
      - repo_id                     = 760882025 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:infrahouse/terraform-aws-pypiserver.git" -> null
      - svn_url                     = "https://github.com/infrahouse/terraform-aws-pypiserver" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
    }

  # module.repos["terraform-aws-pypiserver"].github_team_repository.dev will be destroyed
  # (because module.repos["terraform-aws-pypiserver"] is not in configuration)
  - resource "github_team_repository" "dev" {
      - etag       = "W/\"a539dea8ea703d240bfddcbaf495bc2c8157d71724fd750eb276d0dd994adf21\"" -> null
      - id         = "7332815:terraform-aws-pypiserver" -> null
      - permission = "push" -> null
      - repository = "terraform-aws-pypiserver" -> null
      - team_id    = "7332815" -> null
    }

  # module.repos["terraform-aws-service-network"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-06-18 03:57:27 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-service-network:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-06-18 03:57:27 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-state-bucket"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-10-15 14:59:48 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-state-bucket:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-15 14:59:48 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-state-manager"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-10-09 22:25:46 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-state-manager:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-09 22:25:46 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-update-dns"].github_actions_secret.secret["GH_TOKEN"] will be destroyed
  # (because module.repos["terraform-aws-update-dns"] is not in configuration)
  - resource "github_actions_secret" "secret" {
      - created_at      = "2024-02-12 22:51:30 +0000 UTC" -> null
      - id              = "terraform-aws-update-dns:GH_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "terraform-aws-update-dns" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2024-02-12 22:51:30 +0000 UTC" -> null
    }

  # module.repos["terraform-aws-update-dns"].github_repository.repo will be destroyed
  # (because module.repos["terraform-aws-update-dns"] is not in configuration)
  - resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - description                 = "Module creates a lambda that manages DNS A records for instances in an autoscaling group." -> null
      - etag                        = "W/\"703790c0e9e5d3a2bc0c1d494e96d597cbb58cd1f72fd3e3f36f99c1a27bbba5\"" -> null
      - full_name                   = "infrahouse/terraform-aws-update-dns" -> null
      - git_clone_url               = "git://github.com/infrahouse/terraform-aws-update-dns.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/infrahouse/terraform-aws-update-dns" -> null
      - http_clone_url              = "https://github.com/infrahouse/terraform-aws-update-dns.git" -> null
      - id                          = "terraform-aws-update-dns" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "terraform-aws-update-dns" -> null
      - node_id                     = "R_kgDOLRisTA" -> null
      - primary_language            = "Python" -> null
      - private                     = false -> null
      - repo_id                     = 756591692 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:infrahouse/terraform-aws-update-dns.git" -> null
      - svn_url                     = "https://github.com/infrahouse/terraform-aws-update-dns" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
    }

  # module.repos["terraform-aws-update-dns"].github_team_repository.dev will be destroyed
  # (because module.repos["terraform-aws-update-dns"] is not in configuration)
  - resource "github_team_repository" "dev" {
      - etag       = "W/\"cff84a3f5f4e7b7abc80bb7a50ca899725477400631e29cecf01a7775dc3a1f1\"" -> null
      - id         = "7332815:terraform-aws-update-dns" -> null
      - permission = "push" -> null
      - repository = "terraform-aws-update-dns" -> null
      - team_id    = "7332815" -> null
    }

  # module.repos["terraform-aws-website-pod"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-08-13 19:44:21 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-website-pod:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-08-13 19:44:21 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.infrahouse8-github-control.module.gha-admin.aws_iam_policy.github-assume-all will be created
  + resource "aws_iam_policy" "github-assume-all" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ih-tf-github-control-github-assume-all"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "created_by_module" = "infrahouse/gha-admin/aws"
        }
      + tags_all    = {
          + "created_by"        = "infrahouse8/github-control"
          + "created_by_module" = "infrahouse/gha-admin/aws"
        }
    }

Plan: 28 to add, 3 to change, 35 to destroy.
```
</details>
<details>
<summary>STDERR</summary>

```
Error: GET https://api.github.com/repos/infrahouse8/github-control/invitations?per_page=100: 403 Must have admin rights to Repository. []

  with module.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"],
  on modules/local-repo/repos.tf line 47, in resource "github_repository_collaborator" "collaborators":
  47: resource "github_repository_collaborator" "collaborators" {

```
</details>
<details><summary><i>metadata</i></summary>
<p>
```
eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAic3Rkb3V0IjogIlRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb25cbnBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczpcbiAgKyBjcmVhdGVcbiAgfiB1cGRhdGUgaW4tcGxhY2VcbiAgLSBkZXN0cm95XG4tLysgZGVzdHJveSBhbmQgdGhlbiBjcmVhdGUgcmVwbGFjZW1lbnRcblxuVGVycmFmb3JtIHBsYW5uZWQgdGhlIGZvbGxvd2luZyBhY3Rpb25zLCBidXQgdGhlbiBlbmNvdW50ZXJlZCBhIHByb2JsZW06XG5cbiAgIyBnaXRodWJfb3JnYW5pemF0aW9uX3NldHRpbmdzLmluZnJhaG91c2Ugd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXG4gIH4gcmVzb3VyY2UgXCJnaXRodWJfb3JnYW5pemF0aW9uX3NldHRpbmdzXCIgXCJpbmZyYWhvdXNlXCIge1xuICAgICAgKyBiaWxsaW5nX2VtYWlsICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImJpbGxpbmdAaW5mcmFob3VzZS5jb21cIlxuICAgICAgKyBkZWZhdWx0X3JlcG9zaXRvcnlfcGVybWlzc2lvbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInJlYWRcIlxuICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIjEyMTk4NDI2M1wiXG4gICAgICAgIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiSW5mcmFIb3VzZVwiXG4gICAgICAgICMgKDIyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUuaWg4X3RmX3RlbXBsYXRlLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG8gd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXG4gIH4gcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeVwiIFwicmVwb1wiIHtcbiAgICAgIH4gYWxsb3dfbWVyZ2VfY29tbWl0ICAgICAgICAgID0gZmFsc2UgLT4gdHJ1ZVxuICAgICAgfiBhbGxvd19yZWJhc2VfbWVyZ2UgICAgICAgICAgPSBmYWxzZSAtPiB0cnVlXG4gICAgICB+IGFsbG93X3NxdWFzaF9tZXJnZSAgICAgICAgICA9IGZhbHNlIC0+IHRydWVcbiAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ0ZXJyYWZvcm0tdGVtcGxhdGVcIlxuICAgICAgKyBtZXJnZV9jb21taXRfbWVzc2FnZSAgICAgICAgPSBcIlBSX1RJVExFXCJcbiAgICAgICsgbWVyZ2VfY29tbWl0X3RpdGxlICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCJcbiAgICAgICAgbmFtZSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ0ZXJyYWZvcm0tdGVtcGxhdGVcIlxuICAgICAgKyBzcXVhc2hfbWVyZ2VfY29tbWl0X21lc3NhZ2UgPSBcIkNPTU1JVF9NRVNTQUdFU1wiXG4gICAgICArIHNxdWFzaF9tZXJnZV9jb21taXRfdGl0bGUgICA9IFwiQ09NTUlUX09SX1BSX1RJVExFXCJcbiAgICAgICAgIyAoMjUgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuICAgIH1cblxuICAjIG1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdIG11c3QgYmUgcmVwbGFjZWRcbi0vKyByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwic2VjcmV0XCIge1xuICAgICAgfiBjcmVhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDMtMjAgMTQ6NDg6MzkgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBpZCAgICAgICAgICAgICAgPSBcImdpdGh1Yi1jb250cm9sOkdIX1RPS0VOXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSAjIGZvcmNlcyByZXBsYWNlbWVudFxuICAgICAgfiB1cGRhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDMtMjAgMTQ6NDg6MzkgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAjICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiZ2l0aHViX2JyYW5jaF9wcm90ZWN0aW9uXCIgXCJtYWluXCIge1xuICAgICAgKyBhbGxvd3NfZGVsZXRpb25zICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgYWxsb3dzX2ZvcmNlX3B1c2hlcyAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIGJsb2Nrc19jcmVhdGlvbnMgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBlbmZvcmNlX2FkbWlucyAgICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbG9ja19icmFuY2ggICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIHBhdHRlcm4gICAgICAgICAgICAgICAgICAgICAgICAgPSBcIm1haW5cIlxuICAgICAgKyByZXBvc2l0b3J5X2lkICAgICAgICAgICAgICAgICAgID0gXCJSX2tnRE9JMnZ1N0FcIlxuICAgICAgKyByZXF1aXJlX2NvbnZlcnNhdGlvbl9yZXNvbHV0aW9uID0gZmFsc2VcbiAgICAgICsgcmVxdWlyZV9zaWduZWRfY29tbWl0cyAgICAgICAgICA9IGZhbHNlXG4gICAgICArIHJlcXVpcmVkX2xpbmVhcl9oaXN0b3J5ICAgICAgICAgPSBmYWxzZVxuXG4gICAgICArIHJlcXVpcmVkX3B1bGxfcmVxdWVzdF9yZXZpZXdzIHtcbiAgICAgICAgICArIHJlcXVpcmVfbGFzdF9wdXNoX2FwcHJvdmFsICAgICAgPSBmYWxzZVxuICAgICAgICAgICsgcmVxdWlyZWRfYXBwcm92aW5nX3Jldmlld19jb3VudCA9IDBcbiAgICAgICAgfVxuXG4gICAgICArIHJlcXVpcmVkX3N0YXR1c19jaGVja3Mge1xuICAgICAgICAgICsgY29udGV4dHMgPSBbXG4gICAgICAgICAgICAgICsgXCJUZXJyYWZvcm0gUGxhblwiLFxuICAgICAgICAgICAgXVxuICAgICAgICAgICsgc3RyaWN0ICAgPSB0cnVlXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG8gd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXG4gIH4gcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeVwiIFwicmVwb1wiIHtcbiAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJnaXRodWItY29udHJvbFwiXG4gICAgICAgIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICA9IFwiZ2l0aHViLWNvbnRyb2xcIlxuICAgICAgfiB2dWxuZXJhYmlsaXR5X2FsZXJ0cyAgICAgICAgPSBmYWxzZSAtPiB0cnVlXG4gICAgICAgICMgKDMzIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl0gbXVzdCBiZSByZXBsYWNlZFxuLS8rIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICB+IGNyZWF0ZWRfYXQgICAgICA9IFwiMjAyMy0wNi0zMCAyMzozOToyMyArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGlkICAgICAgICAgICAgICA9IFwiYXdzLWNvbnRyb2w6R0hfVE9LRU5cIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IHBsYWludGV4dF92YWx1ZSA9IChzZW5zaXRpdmUgdmFsdWUpICMgZm9yY2VzIHJlcGxhY2VtZW50XG4gICAgICB+IHVwZGF0ZWRfYXQgICAgICA9IFwiMjAyMy0wNi0zMCAyMzozOToyMyArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICMgKDIgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuICAgIH1cblxuICAjIG1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl0gbXVzdCBiZSByZXBsYWNlZFxuLS8rIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICB+IGNyZWF0ZWRfYXQgICAgICA9IFwiMjAyMy0wNi0zMCAyMzozOToyNyArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGlkICAgICAgICAgICAgICA9IFwiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0OkdIX1RPS0VOXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSAjIGZvcmNlcyByZXBsYWNlbWVudFxuICAgICAgfiB1cGRhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDYtMzAgMjM6Mzk6MjcgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAjICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdIG11c3QgYmUgcmVwbGFjZWRcbi0vKyByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwic2VjcmV0XCIge1xuICAgICAgfiBjcmVhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDYtMzAgMjM6Mzk6MjggKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBpZCAgICAgICAgICAgICAgPSBcImF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNzpHSF9UT0tFTlwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gcGxhaW50ZXh0X3ZhbHVlID0gKHNlbnNpdGl2ZSB2YWx1ZSkgIyBmb3JjZXMgcmVwbGFjZW1lbnRcbiAgICAgIH4gdXBkYXRlZF9hdCAgICAgID0gXCIyMDIzLTA2LTMwIDIzOjM5OjI4ICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgIyAoMiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXSBtdXN0IGJlIHJlcGxhY2VkXG4tLysgcmVzb3VyY2UgXCJnaXRodWJfYWN0aW9uc19zZWNyZXRcIiBcInNlY3JldFwiIHtcbiAgICAgIH4gY3JlYXRlZF9hdCAgICAgID0gXCIyMDIzLTA3LTA5IDE2OjExOjEzICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gaWQgICAgICAgICAgICAgID0gXCJhd3MtY29udHJvbC00OTMzNzA4MjY0MjQ6R0hfVE9LRU5cIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IHBsYWludGV4dF92YWx1ZSA9IChzZW5zaXRpdmUgdmFsdWUpICMgZm9yY2VzIHJlcGxhY2VtZW50XG4gICAgICB+IHVwZGF0ZWRfYXQgICAgICA9IFwiMjAyMy0wNy0wOSAxNjoxMToxMyArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICMgKDIgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuICAgIH1cblxuICAjIG1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl0gbXVzdCBiZSByZXBsYWNlZFxuLS8rIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICB+IGNyZWF0ZWRfYXQgICAgICA9IFwiMjAyMy0wMy0yMiAwMzowMzoxMCArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGlkICAgICAgICAgICAgICA9IFwiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sOkdIX1RPS0VOXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSAjIGZvcmNlcyByZXBsYWNlbWVudFxuICAgICAgfiB1cGRhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDMtMjIgMDM6MDM6MTAgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAjICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLWNvbVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl0gbXVzdCBiZSByZXBsYWNlZFxuLS8rIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICB+IGNyZWF0ZWRfYXQgICAgICA9IFwiMjAyMy0wOC0xOSAyMDozNjoyMSArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGlkICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1jb206R0hfVE9LRU5cIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IHBsYWludGV4dF92YWx1ZSA9IChzZW5zaXRpdmUgdmFsdWUpICMgZm9yY2VzIHJlcGxhY2VtZW50XG4gICAgICB+IHVwZGF0ZWRfYXQgICAgICA9IFwiMjAyMy0wOC0xOSAyMDozNjoyMSArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICMgKDIgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuICAgIH1cblxuICAjIG1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtcHVwcGV0LWRhdGFcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdIG11c3QgYmUgcmVwbGFjZWRcbi0vKyByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwic2VjcmV0XCIge1xuICAgICAgfiBjcmVhdGVkX2F0ICAgICAgPSBcIjIwMjMtMTEtMDggMTM6MDI6NDUgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBpZCAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtcHVwcGV0LWRhdGE6R0hfVE9LRU5cIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IHBsYWludGV4dF92YWx1ZSA9IChzZW5zaXRpdmUgdmFsdWUpICMgZm9yY2VzIHJlcGxhY2VtZW50XG4gICAgICB+IHVwZGF0ZWRfYXQgICAgICA9IFwiMjAyMy0xMS0wOCAxMzowMjo0NSArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICMgKDIgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuICAgIH1cblxuICAjIG1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl0gbXVzdCBiZSByZXBsYWNlZFxuLS8rIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICB+IGNyZWF0ZWRfYXQgICAgICA9IFwiMjAyMy0wMy0yMiAwMzowMzowMSArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGlkICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS10b29sa2l0OkdIX1RPS0VOXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSAjIGZvcmNlcyByZXBsYWNlbWVudFxuICAgICAgfiB1cGRhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDMtMjIgMDM6MDM6MDEgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAjICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdIG11c3QgYmUgcmVwbGFjZWRcbi0vKyByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwic2VjcmV0XCIge1xuICAgICAgfiBjcmVhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDMtMjIgMDM6MDM6MDIgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBpZCAgICAgICAgICAgICAgPSBcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYTpHSF9UT0tFTlwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gcGxhaW50ZXh0X3ZhbHVlID0gKHNlbnNpdGl2ZSB2YWx1ZSkgIyBmb3JjZXMgcmVwbGFjZW1lbnRcbiAgICAgIH4gdXBkYXRlZF9hdCAgICAgID0gXCIyMDIzLTAzLTIyIDAzOjAzOjAyICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgIyAoMiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1wicHJveHlzcWwtc2FuZGJveFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl0gbXVzdCBiZSByZXBsYWNlZFxuLS8rIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICB+IGNyZWF0ZWRfYXQgICAgICA9IFwiMjAyMy0wNi0xNSAxNDo1Nzo1NyArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGlkICAgICAgICAgICAgICA9IFwicHJveHlzcWwtc2FuZGJveDpHSF9UT0tFTlwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gcGxhaW50ZXh0X3ZhbHVlID0gKHNlbnNpdGl2ZSB2YWx1ZSkgIyBmb3JjZXMgcmVwbGFjZW1lbnRcbiAgICAgIH4gdXBkYXRlZF9hdCAgICAgID0gXCIyMDIzLTA2LTE1IDE0OjU3OjU3ICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgIyAoMiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1wicHVwcGV0LWNvZGVcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdIG11c3QgYmUgcmVwbGFjZWRcbi0vKyByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwic2VjcmV0XCIge1xuICAgICAgfiBjcmVhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDgtMDMgMTU6Mzk6MTQgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBpZCAgICAgICAgICAgICAgPSBcInB1cHBldC1jb2RlOkdIX1RPS0VOXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSAjIGZvcmNlcyByZXBsYWNlbWVudFxuICAgICAgfiB1cGRhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDgtMDMgMTU6Mzk6MTQgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAjICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWNpLWNkXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXSBtdXN0IGJlIHJlcGxhY2VkXG4tLysgcmVzb3VyY2UgXCJnaXRodWJfYWN0aW9uc19zZWNyZXRcIiBcInNlY3JldFwiIHtcbiAgICAgIH4gY3JlYXRlZF9hdCAgICAgID0gXCIyMDIzLTEwLTE4IDAwOjI5OjMzICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gaWQgICAgICAgICAgICAgID0gXCJ0ZXJyYWZvcm0tYXdzLWNpLWNkOkdIX1RPS0VOXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSAjIGZvcmNlcyByZXBsYWNlbWVudFxuICAgICAgfiB1cGRhdGVkX2F0ICAgICAgPSBcIjIwMjMtMTAtMTggMDA6Mjk6MzMgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAjICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdIG11c3QgYmUgcmVwbGFjZWRcbi0vKyByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwic2VjcmV0XCIge1xuICAgICAgfiBjcmVhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDgtMTggMTU6NDM6NDMgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBpZCAgICAgICAgICAgICAgPSBcInRlcnJhZm9ybS1hd3MtY2xvdWQtaW5pdDpHSF9UT0tFTlwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gcGxhaW50ZXh0X3ZhbHVlID0gKHNlbnNpdGl2ZSB2YWx1ZSkgIyBmb3JjZXMgcmVwbGFjZW1lbnRcbiAgICAgIH4gdXBkYXRlZF9hdCAgICAgID0gXCIyMDIzLTA4LTE4IDE1OjQzOjQzICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgIyAoMiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwb1wiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl0gbXVzdCBiZSByZXBsYWNlZFxuLS8rIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICB+IGNyZWF0ZWRfYXQgICAgICA9IFwiMjAyMy0wNy0yNCAyMzozMzozOCArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGlkICAgICAgICAgICAgICA9IFwidGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwbzpHSF9UT0tFTlwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gcGxhaW50ZXh0X3ZhbHVlID0gKHNlbnNpdGl2ZSB2YWx1ZSkgIyBmb3JjZXMgcmVwbGFjZW1lbnRcbiAgICAgIH4gdXBkYXRlZF9hdCAgICAgID0gXCIyMDIzLTA3LTI0IDIzOjMzOjM4ICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgIyAoMiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1lY3NcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdIG11c3QgYmUgcmVwbGFjZWRcbi0vKyByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwic2VjcmV0XCIge1xuICAgICAgfiBjcmVhdGVkX2F0ICAgICAgPSBcIjIwMjMtMTEtMjMgMTY6MDE6NTEgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBpZCAgICAgICAgICAgICAgPSBcInRlcnJhZm9ybS1hd3MtZWNzOkdIX1RPS0VOXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSAjIGZvcmNlcyByZXBsYWNlbWVudFxuICAgICAgfiB1cGRhdGVkX2F0ICAgICAgPSBcIjIwMjMtMTEtMjMgMTY6MDE6NTEgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAjICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWVsYXN0aWNzZWFyY2hcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdIG11c3QgYmUgcmVwbGFjZWRcbi0vKyByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwic2VjcmV0XCIge1xuICAgICAgfiBjcmVhdGVkX2F0ICAgICAgPSBcIjIwMjQtMDItMDUgMTc6MzE6MDEgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBpZCAgICAgICAgICAgICAgPSBcInRlcnJhZm9ybS1hd3MtZWxhc3RpY3NlYXJjaDpHSF9UT0tFTlwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gcGxhaW50ZXh0X3ZhbHVlID0gKHNlbnNpdGl2ZSB2YWx1ZSkgIyBmb3JjZXMgcmVwbGFjZW1lbnRcbiAgICAgIH4gdXBkYXRlZF9hdCAgICAgID0gXCIyMDI0LTAyLTA1IDE3OjMxOjAxICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgIyAoMiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlclwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl0gbXVzdCBiZSByZXBsYWNlZFxuLS8rIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICB+IGNyZWF0ZWRfYXQgICAgICA9IFwiMjAyMy0wNy0wMyAyMzowNTowMCArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGlkICAgICAgICAgICAgICA9IFwidGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlcjpHSF9UT0tFTlwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gcGxhaW50ZXh0X3ZhbHVlID0gKHNlbnNpdGl2ZSB2YWx1ZSkgIyBmb3JjZXMgcmVwbGFjZW1lbnRcbiAgICAgIH4gdXBkYXRlZF9hdCAgICAgID0gXCIyMDIzLTA3LTAzIDIzOjA1OjAwICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgIyAoMiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naGEtYWRtaW5cIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdIG11c3QgYmUgcmVwbGFjZWRcbi0vKyByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwic2VjcmV0XCIge1xuICAgICAgfiBjcmVhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDctMDIgMTU6MTU6MjggKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBpZCAgICAgICAgICAgICAgPSBcInRlcnJhZm9ybS1hd3MtZ2hhLWFkbWluOkdIX1RPS0VOXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSAjIGZvcmNlcyByZXBsYWNlbWVudFxuICAgICAgfiB1cGRhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDctMDIgMTU6MTU6MjggKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAjICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdpdGh1Yi1yb2xlXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXSBtdXN0IGJlIHJlcGxhY2VkXG4tLysgcmVzb3VyY2UgXCJnaXRodWJfYWN0aW9uc19zZWNyZXRcIiBcInNlY3JldFwiIHtcbiAgICAgIH4gY3JlYXRlZF9hdCAgICAgID0gXCIyMDIzLTExLTA3IDIzOjA5OjQ0ICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gaWQgICAgICAgICAgICAgID0gXCJ0ZXJyYWZvcm0tYXdzLWdpdGh1Yi1yb2xlOkdIX1RPS0VOXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSAjIGZvcmNlcyByZXBsYWNlbWVudFxuICAgICAgfiB1cGRhdGVkX2F0ICAgICAgPSBcIjIwMjMtMTEtMDcgMjM6MDk6NDQgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAjICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWluc3RhbmNlLXByb2ZpbGVcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdIG11c3QgYmUgcmVwbGFjZWRcbi0vKyByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwic2VjcmV0XCIge1xuICAgICAgfiBjcmVhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDgtMTAgMTU6MTA6MDcgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBpZCAgICAgICAgICAgICAgPSBcInRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZTpHSF9UT0tFTlwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gcGxhaW50ZXh0X3ZhbHVlID0gKHNlbnNpdGl2ZSB2YWx1ZSkgIyBmb3JjZXMgcmVwbGFjZW1lbnRcbiAgICAgIH4gdXBkYXRlZF9hdCAgICAgID0gXCIyMDIzLTA4LTEwIDE1OjEwOjA3ICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgIyAoMiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1qdW1waG9zdFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl0gbXVzdCBiZSByZXBsYWNlZFxuLS8rIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICB+IGNyZWF0ZWRfYXQgICAgICA9IFwiMjAyMy0xMS0wMSAxNjoxNjowMCArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGlkICAgICAgICAgICAgICA9IFwidGVycmFmb3JtLWF3cy1qdW1waG9zdDpHSF9UT0tFTlwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gcGxhaW50ZXh0X3ZhbHVlID0gKHNlbnNpdGl2ZSB2YWx1ZSkgIyBmb3JjZXMgcmVwbGFjZW1lbnRcbiAgICAgIH4gdXBkYXRlZF9hdCAgICAgID0gXCIyMDIzLTExLTAxIDE2OjE2OjAwICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgIyAoMiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1raWJhbmFcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdIHdpbGwgYmUgZGVzdHJveWVkXG4gICMgKGJlY2F1c2UgbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1raWJhbmFcIl0gaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pXG4gIC0gcmVzb3VyY2UgXCJnaXRodWJfYWN0aW9uc19zZWNyZXRcIiBcInNlY3JldFwiIHtcbiAgICAgIC0gY3JlYXRlZF9hdCAgICAgID0gXCIyMDI0LTAyLTE4IDAyOjExOjU2ICswMDAwIFVUQ1wiIC0+IG51bGxcbiAgICAgIC0gaWQgICAgICAgICAgICAgID0gXCJ0ZXJyYWZvcm0tYXdzLWtpYmFuYTpHSF9UT0tFTlwiIC0+IG51bGxcbiAgICAgIC0gcGxhaW50ZXh0X3ZhbHVlID0gKHNlbnNpdGl2ZSB2YWx1ZSkgLT4gbnVsbFxuICAgICAgLSByZXBvc2l0b3J5ICAgICAgPSBcInRlcnJhZm9ybS1hd3Mta2liYW5hXCIgLT4gbnVsbFxuICAgICAgLSBzZWNyZXRfbmFtZSAgICAgPSBcIkdIX1RPS0VOXCIgLT4gbnVsbFxuICAgICAgLSB1cGRhdGVkX2F0ICAgICAgPSBcIjIwMjQtMDItMTggMDI6MTE6NTYgKzAwMDAgVVRDXCIgLT4gbnVsbFxuICAgIH1cblxuICAjIG1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mta2liYW5hXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG8gd2lsbCBiZSBkZXN0cm95ZWRcbiAgIyAoYmVjYXVzZSBtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWtpYmFuYVwiXSBpcyBub3QgaW4gY29uZmlndXJhdGlvbilcbiAgLSByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIge1xuICAgICAgLSBhbGxvd19hdXRvX21lcmdlICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGFsbG93X21lcmdlX2NvbW1pdCAgICAgICAgICA9IHRydWUgLT4gbnVsbFxuICAgICAgLSBhbGxvd19yZWJhc2VfbWVyZ2UgICAgICAgICAgPSB0cnVlIC0+IG51bGxcbiAgICAgIC0gYWxsb3dfc3F1YXNoX21lcmdlICAgICAgICAgID0gdHJ1ZSAtPiBudWxsXG4gICAgICAtIGFsbG93X3VwZGF0ZV9icmFuY2ggICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gYXJjaGl2ZWQgICAgICAgICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBkZWZhdWx0X2JyYW5jaCAgICAgICAgICAgICAgPSBcIm1haW5cIiAtPiBudWxsXG4gICAgICAtIGRlbGV0ZV9icmFuY2hfb25fbWVyZ2UgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gZGVzY3JpcHRpb24gICAgICAgICAgICAgICAgID0gXCJNb2R1bGUgdGhhdCBkZXBsb3lzIEtpYmFuYVwiIC0+IG51bGxcbiAgICAgIC0gZXRhZyAgICAgICAgICAgICAgICAgICAgICAgID0gXCJXL1xcXCI2NWQ3ZGI1NDQ5ZjIwZjQwMzdiOGRmZWU5NTJlZDgyM2Y0OTQyMTUyZTRjODAzNzg5YzI3YWViMGExZGRlODJhXFxcIlwiIC0+IG51bGxcbiAgICAgIC0gZnVsbF9uYW1lICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlL3RlcnJhZm9ybS1hd3Mta2liYW5hXCIgLT4gbnVsbFxuICAgICAgLSBnaXRfY2xvbmVfdXJsICAgICAgICAgICAgICAgPSBcImdpdDovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS90ZXJyYWZvcm0tYXdzLWtpYmFuYS5naXRcIiAtPiBudWxsXG4gICAgICAtIGhhc19kaXNjdXNzaW9ucyAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gaGFzX2Rvd25sb2FkcyAgICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBoYXNfaXNzdWVzICAgICAgICAgICAgICAgICAgPSB0cnVlIC0+IG51bGxcbiAgICAgIC0gaGFzX3Byb2plY3RzICAgICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBoYXNfd2lraSAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGh0bWxfdXJsICAgICAgICAgICAgICAgICAgICA9IFwiaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvdGVycmFmb3JtLWF3cy1raWJhbmFcIiAtPiBudWxsXG4gICAgICAtIGh0dHBfY2xvbmVfdXJsICAgICAgICAgICAgICA9IFwiaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvdGVycmFmb3JtLWF3cy1raWJhbmEuZ2l0XCIgLT4gbnVsbFxuICAgICAgLSBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInRlcnJhZm9ybS1hd3Mta2liYW5hXCIgLT4gbnVsbFxuICAgICAgLSBpc190ZW1wbGF0ZSAgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIG1lcmdlX2NvbW1pdF9tZXNzYWdlICAgICAgICA9IFwiUFJfVElUTEVcIiAtPiBudWxsXG4gICAgICAtIG1lcmdlX2NvbW1pdF90aXRsZSAgICAgICAgICA9IFwiTUVSR0VfTUVTU0FHRVwiIC0+IG51bGxcbiAgICAgIC0gbmFtZSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ0ZXJyYWZvcm0tYXdzLWtpYmFuYVwiIC0+IG51bGxcbiAgICAgIC0gbm9kZV9pZCAgICAgICAgICAgICAgICAgICAgID0gXCJSX2tnRE9MVUR3SVFcIiAtPiBudWxsXG4gICAgICAtIHByaW1hcnlfbGFuZ3VhZ2UgICAgICAgICAgICA9IFwiSENMXCIgLT4gbnVsbFxuICAgICAgLSBwcml2YXRlICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIHJlcG9faWQgICAgICAgICAgICAgICAgICAgICA9IDc1OTIzMDQ5NyAtPiBudWxsXG4gICAgICAtIHNxdWFzaF9tZXJnZV9jb21taXRfbWVzc2FnZSA9IFwiQ09NTUlUX01FU1NBR0VTXCIgLT4gbnVsbFxuICAgICAgLSBzcXVhc2hfbWVyZ2VfY29tbWl0X3RpdGxlICAgPSBcIkNPTU1JVF9PUl9QUl9USVRMRVwiIC0+IG51bGxcbiAgICAgIC0gc3NoX2Nsb25lX3VybCAgICAgICAgICAgICAgID0gXCJnaXRAZ2l0aHViLmNvbTppbmZyYWhvdXNlL3RlcnJhZm9ybS1hd3Mta2liYW5hLmdpdFwiIC0+IG51bGxcbiAgICAgIC0gc3ZuX3VybCAgICAgICAgICAgICAgICAgICAgID0gXCJodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS90ZXJyYWZvcm0tYXdzLWtpYmFuYVwiIC0+IG51bGxcbiAgICAgIC0gdG9waWNzICAgICAgICAgICAgICAgICAgICAgID0gW10gLT4gbnVsbFxuICAgICAgLSB2aXNpYmlsaXR5ICAgICAgICAgICAgICAgICAgPSBcInB1YmxpY1wiIC0+IG51bGxcbiAgICAgIC0gdnVsbmVyYWJpbGl0eV9hbGVydHMgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgIH1cblxuICAjIG1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mta2liYW5hXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2IHdpbGwgYmUgZGVzdHJveWVkXG4gICMgKGJlY2F1c2UgbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1raWJhbmFcIl0gaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pXG4gIC0gcmVzb3VyY2UgXCJnaXRodWJfdGVhbV9yZXBvc2l0b3J5XCIgXCJkZXZcIiB7XG4gICAgICAtIGV0YWcgICAgICAgPSBcIlcvXFxcImZjNTZhMTAyZTlhYmYzOGEyN2Y0ZGE5MjRlYTJjNTUwMDU0YTY1M2RlNWFlOWRiYzNlMDc1YWI5YmEyMjNkYjZcXFwiXCIgLT4gbnVsbFxuICAgICAgLSBpZCAgICAgICAgID0gXCI3MzMyODE1OnRlcnJhZm9ybS1hd3Mta2liYW5hXCIgLT4gbnVsbFxuICAgICAgLSBwZXJtaXNzaW9uID0gXCJwdXNoXCIgLT4gbnVsbFxuICAgICAgLSByZXBvc2l0b3J5ID0gXCJ0ZXJyYWZvcm0tYXdzLWtpYmFuYVwiIC0+IG51bGxcbiAgICAgIC0gdGVhbV9pZCAgICA9IFwiNzMzMjgxNVwiIC0+IG51bGxcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXB5cGlzZXJ2ZXJcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdIHdpbGwgYmUgZGVzdHJveWVkXG4gICMgKGJlY2F1c2UgbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1weXBpc2VydmVyXCJdIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKVxuICAtIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICAtIGNyZWF0ZWRfYXQgICAgICA9IFwiMjAyNC0wMi0yMCAyMDo1MzowNSArMDAwMCBVVENcIiAtPiBudWxsXG4gICAgICAtIGlkICAgICAgICAgICAgICA9IFwidGVycmFmb3JtLWF3cy1weXBpc2VydmVyOkdIX1RPS0VOXCIgLT4gbnVsbFxuICAgICAgLSBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSAtPiBudWxsXG4gICAgICAtIHJlcG9zaXRvcnkgICAgICA9IFwidGVycmFmb3JtLWF3cy1weXBpc2VydmVyXCIgLT4gbnVsbFxuICAgICAgLSBzZWNyZXRfbmFtZSAgICAgPSBcIkdIX1RPS0VOXCIgLT4gbnVsbFxuICAgICAgLSB1cGRhdGVkX2F0ICAgICAgPSBcIjIwMjQtMDItMjAgMjA6NTM6MDUgKzAwMDAgVVRDXCIgLT4gbnVsbFxuICAgIH1cblxuICAjIG1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtcHlwaXNlcnZlclwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvIHdpbGwgYmUgZGVzdHJveWVkXG4gICMgKGJlY2F1c2UgbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1weXBpc2VydmVyXCJdIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKVxuICAtIHJlc291cmNlIFwiZ2l0aHViX3JlcG9zaXRvcnlcIiBcInJlcG9cIiB7XG4gICAgICAtIGFsbG93X2F1dG9fbWVyZ2UgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gYWxsb3dfbWVyZ2VfY29tbWl0ICAgICAgICAgID0gdHJ1ZSAtPiBudWxsXG4gICAgICAtIGFsbG93X3JlYmFzZV9tZXJnZSAgICAgICAgICA9IHRydWUgLT4gbnVsbFxuICAgICAgLSBhbGxvd19zcXVhc2hfbWVyZ2UgICAgICAgICAgPSB0cnVlIC0+IG51bGxcbiAgICAgIC0gYWxsb3dfdXBkYXRlX2JyYW5jaCAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBhcmNoaXZlZCAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGRlZmF1bHRfYnJhbmNoICAgICAgICAgICAgICA9IFwibWFpblwiIC0+IG51bGxcbiAgICAgIC0gZGVsZXRlX2JyYW5jaF9vbl9tZXJnZSAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBkZXNjcmlwdGlvbiAgICAgICAgICAgICAgICAgPSBcIlRlcnJhZm9ybSBtb2R1bGUgdGhhdCBkZXBsb3lzIGEgcHJpdmF0ZSBQeVBJIHNlcnZlci5cIiAtPiBudWxsXG4gICAgICAtIGV0YWcgICAgICAgICAgICAgICAgICAgICAgICA9IFwiVy9cXFwiOWMyZTQ1M2NhOTk2YjQ4YzgxZGVhZmE2MDViNTU5ZDNhMWYxOGEzNjFjYTVhMWY2YjY4NmM5OTFkMWM3YjRkMlxcXCJcIiAtPiBudWxsXG4gICAgICAtIGZ1bGxfbmFtZSAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS90ZXJyYWZvcm0tYXdzLXB5cGlzZXJ2ZXJcIiAtPiBudWxsXG4gICAgICAtIGdpdF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IFwiZ2l0Oi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL3RlcnJhZm9ybS1hd3MtcHlwaXNlcnZlci5naXRcIiAtPiBudWxsXG4gICAgICAtIGhhc19kaXNjdXNzaW9ucyAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gaGFzX2Rvd25sb2FkcyAgICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBoYXNfaXNzdWVzICAgICAgICAgICAgICAgICAgPSB0cnVlIC0+IG51bGxcbiAgICAgIC0gaGFzX3Byb2plY3RzICAgICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBoYXNfd2lraSAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGh0bWxfdXJsICAgICAgICAgICAgICAgICAgICA9IFwiaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvdGVycmFmb3JtLWF3cy1weXBpc2VydmVyXCIgLT4gbnVsbFxuICAgICAgLSBodHRwX2Nsb25lX3VybCAgICAgICAgICAgICAgPSBcImh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL3RlcnJhZm9ybS1hd3MtcHlwaXNlcnZlci5naXRcIiAtPiBudWxsXG4gICAgICAtIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwidGVycmFmb3JtLWF3cy1weXBpc2VydmVyXCIgLT4gbnVsbFxuICAgICAgLSBpc190ZW1wbGF0ZSAgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIG1lcmdlX2NvbW1pdF9tZXNzYWdlICAgICAgICA9IFwiUFJfVElUTEVcIiAtPiBudWxsXG4gICAgICAtIG1lcmdlX2NvbW1pdF90aXRsZSAgICAgICAgICA9IFwiTUVSR0VfTUVTU0FHRVwiIC0+IG51bGxcbiAgICAgIC0gbmFtZSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ0ZXJyYWZvcm0tYXdzLXB5cGlzZXJ2ZXJcIiAtPiBudWxsXG4gICAgICAtIG5vZGVfaWQgICAgICAgICAgICAgICAgICAgICA9IFwiUl9rZ0RPTFZvamFRXCIgLT4gbnVsbFxuICAgICAgLSBwcmltYXJ5X2xhbmd1YWdlICAgICAgICAgICAgPSBcIkhDTFwiIC0+IG51bGxcbiAgICAgIC0gcHJpdmF0ZSAgICAgICAgICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSByZXBvX2lkICAgICAgICAgICAgICAgICAgICAgPSA3NjA4ODIwMjUgLT4gbnVsbFxuICAgICAgLSBzcXVhc2hfbWVyZ2VfY29tbWl0X21lc3NhZ2UgPSBcIkNPTU1JVF9NRVNTQUdFU1wiIC0+IG51bGxcbiAgICAgIC0gc3F1YXNoX21lcmdlX2NvbW1pdF90aXRsZSAgID0gXCJDT01NSVRfT1JfUFJfVElUTEVcIiAtPiBudWxsXG4gICAgICAtIHNzaF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IFwiZ2l0QGdpdGh1Yi5jb206aW5mcmFob3VzZS90ZXJyYWZvcm0tYXdzLXB5cGlzZXJ2ZXIuZ2l0XCIgLT4gbnVsbFxuICAgICAgLSBzdm5fdXJsICAgICAgICAgICAgICAgICAgICAgPSBcImh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL3RlcnJhZm9ybS1hd3MtcHlwaXNlcnZlclwiIC0+IG51bGxcbiAgICAgIC0gdG9waWNzICAgICAgICAgICAgICAgICAgICAgID0gW10gLT4gbnVsbFxuICAgICAgLSB2aXNpYmlsaXR5ICAgICAgICAgICAgICAgICAgPSBcInB1YmxpY1wiIC0+IG51bGxcbiAgICAgIC0gdnVsbmVyYWJpbGl0eV9hbGVydHMgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgIH1cblxuICAjIG1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtcHlwaXNlcnZlclwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldiB3aWxsIGJlIGRlc3Ryb3llZFxuICAjIChiZWNhdXNlIG1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtcHlwaXNlcnZlclwiXSBpcyBub3QgaW4gY29uZmlndXJhdGlvbilcbiAgLSByZXNvdXJjZSBcImdpdGh1Yl90ZWFtX3JlcG9zaXRvcnlcIiBcImRldlwiIHtcbiAgICAgIC0gZXRhZyAgICAgICA9IFwiVy9cXFwiYTUzOWRlYThlYTcwM2QyNDBiZmRkY2JhZjQ5NWJjMmM4MTU3ZDcxNzI0ZmQ3NTBlYjI3NmQwZGQ5OTRhZGYyMVxcXCJcIiAtPiBudWxsXG4gICAgICAtIGlkICAgICAgICAgPSBcIjczMzI4MTU6dGVycmFmb3JtLWF3cy1weXBpc2VydmVyXCIgLT4gbnVsbFxuICAgICAgLSBwZXJtaXNzaW9uID0gXCJwdXNoXCIgLT4gbnVsbFxuICAgICAgLSByZXBvc2l0b3J5ID0gXCJ0ZXJyYWZvcm0tYXdzLXB5cGlzZXJ2ZXJcIiAtPiBudWxsXG4gICAgICAtIHRlYW1faWQgICAgPSBcIjczMzI4MTVcIiAtPiBudWxsXG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdIG11c3QgYmUgcmVwbGFjZWRcbi0vKyByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwic2VjcmV0XCIge1xuICAgICAgfiBjcmVhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDYtMTggMDM6NTc6MjcgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBpZCAgICAgICAgICAgICAgPSBcInRlcnJhZm9ybS1hd3Mtc2VydmljZS1uZXR3b3JrOkdIX1RPS0VOXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSAjIGZvcmNlcyByZXBsYWNlbWVudFxuICAgICAgfiB1cGRhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDYtMTggMDM6NTc6MjcgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAjICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLWJ1Y2tldFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl0gbXVzdCBiZSByZXBsYWNlZFxuLS8rIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICB+IGNyZWF0ZWRfYXQgICAgICA9IFwiMjAyMy0xMC0xNSAxNDo1OTo0OCArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGlkICAgICAgICAgICAgICA9IFwidGVycmFmb3JtLWF3cy1zdGF0ZS1idWNrZXQ6R0hfVE9LRU5cIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IHBsYWludGV4dF92YWx1ZSA9IChzZW5zaXRpdmUgdmFsdWUpICMgZm9yY2VzIHJlcGxhY2VtZW50XG4gICAgICB+IHVwZGF0ZWRfYXQgICAgICA9IFwiMjAyMy0xMC0xNSAxNDo1OTo0OCArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICMgKDIgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuICAgIH1cblxuICAjIG1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc3RhdGUtbWFuYWdlclwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl0gbXVzdCBiZSByZXBsYWNlZFxuLS8rIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICB+IGNyZWF0ZWRfYXQgICAgICA9IFwiMjAyMy0xMC0wOSAyMjoyNTo0NiArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGlkICAgICAgICAgICAgICA9IFwidGVycmFmb3JtLWF3cy1zdGF0ZS1tYW5hZ2VyOkdIX1RPS0VOXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSAjIGZvcmNlcyByZXBsYWNlbWVudFxuICAgICAgfiB1cGRhdGVkX2F0ICAgICAgPSBcIjIwMjMtMTAtMDkgMjI6MjU6NDYgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAjICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXVwZGF0ZS1kbnNcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdIHdpbGwgYmUgZGVzdHJveWVkXG4gICMgKGJlY2F1c2UgbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy11cGRhdGUtZG5zXCJdIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKVxuICAtIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICAtIGNyZWF0ZWRfYXQgICAgICA9IFwiMjAyNC0wMi0xMiAyMjo1MTozMCArMDAwMCBVVENcIiAtPiBudWxsXG4gICAgICAtIGlkICAgICAgICAgICAgICA9IFwidGVycmFmb3JtLWF3cy11cGRhdGUtZG5zOkdIX1RPS0VOXCIgLT4gbnVsbFxuICAgICAgLSBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSAtPiBudWxsXG4gICAgICAtIHJlcG9zaXRvcnkgICAgICA9IFwidGVycmFmb3JtLWF3cy11cGRhdGUtZG5zXCIgLT4gbnVsbFxuICAgICAgLSBzZWNyZXRfbmFtZSAgICAgPSBcIkdIX1RPS0VOXCIgLT4gbnVsbFxuICAgICAgLSB1cGRhdGVkX2F0ICAgICAgPSBcIjIwMjQtMDItMTIgMjI6NTE6MzAgKzAwMDAgVVRDXCIgLT4gbnVsbFxuICAgIH1cblxuICAjIG1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtdXBkYXRlLWRuc1wiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvIHdpbGwgYmUgZGVzdHJveWVkXG4gICMgKGJlY2F1c2UgbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy11cGRhdGUtZG5zXCJdIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKVxuICAtIHJlc291cmNlIFwiZ2l0aHViX3JlcG9zaXRvcnlcIiBcInJlcG9cIiB7XG4gICAgICAtIGFsbG93X2F1dG9fbWVyZ2UgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gYWxsb3dfbWVyZ2VfY29tbWl0ICAgICAgICAgID0gdHJ1ZSAtPiBudWxsXG4gICAgICAtIGFsbG93X3JlYmFzZV9tZXJnZSAgICAgICAgICA9IHRydWUgLT4gbnVsbFxuICAgICAgLSBhbGxvd19zcXVhc2hfbWVyZ2UgICAgICAgICAgPSB0cnVlIC0+IG51bGxcbiAgICAgIC0gYWxsb3dfdXBkYXRlX2JyYW5jaCAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBhcmNoaXZlZCAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGRlZmF1bHRfYnJhbmNoICAgICAgICAgICAgICA9IFwibWFpblwiIC0+IG51bGxcbiAgICAgIC0gZGVsZXRlX2JyYW5jaF9vbl9tZXJnZSAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBkZXNjcmlwdGlvbiAgICAgICAgICAgICAgICAgPSBcIk1vZHVsZSBjcmVhdGVzIGEgbGFtYmRhIHRoYXQgbWFuYWdlcyBETlMgQSByZWNvcmRzIGZvciBpbnN0YW5jZXMgaW4gYW4gYXV0b3NjYWxpbmcgZ3JvdXAuXCIgLT4gbnVsbFxuICAgICAgLSBldGFnICAgICAgICAgICAgICAgICAgICAgICAgPSBcIlcvXFxcIjcwMzc5MGMwZTllNWQzYTJiYzBjMWQ0OTRlOTZkNTk3Y2JiNThjZDFmNzJmZDNlM2YzNmY5OWMxYTI3YmJiYTVcXFwiXCIgLT4gbnVsbFxuICAgICAgLSBmdWxsX25hbWUgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UvdGVycmFmb3JtLWF3cy11cGRhdGUtZG5zXCIgLT4gbnVsbFxuICAgICAgLSBnaXRfY2xvbmVfdXJsICAgICAgICAgICAgICAgPSBcImdpdDovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS90ZXJyYWZvcm0tYXdzLXVwZGF0ZS1kbnMuZ2l0XCIgLT4gbnVsbFxuICAgICAgLSBoYXNfZGlzY3Vzc2lvbnMgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGhhc19kb3dubG9hZHMgICAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gaGFzX2lzc3VlcyAgICAgICAgICAgICAgICAgID0gdHJ1ZSAtPiBudWxsXG4gICAgICAtIGhhc19wcm9qZWN0cyAgICAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gaGFzX3dpa2kgICAgICAgICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBodG1sX3VybCAgICAgICAgICAgICAgICAgICAgPSBcImh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL3RlcnJhZm9ybS1hd3MtdXBkYXRlLWRuc1wiIC0+IG51bGxcbiAgICAgIC0gaHR0cF9jbG9uZV91cmwgICAgICAgICAgICAgID0gXCJodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS90ZXJyYWZvcm0tYXdzLXVwZGF0ZS1kbnMuZ2l0XCIgLT4gbnVsbFxuICAgICAgLSBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInRlcnJhZm9ybS1hd3MtdXBkYXRlLWRuc1wiIC0+IG51bGxcbiAgICAgIC0gaXNfdGVtcGxhdGUgICAgICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBtZXJnZV9jb21taXRfbWVzc2FnZSAgICAgICAgPSBcIlBSX1RJVExFXCIgLT4gbnVsbFxuICAgICAgLSBtZXJnZV9jb21taXRfdGl0bGUgICAgICAgICAgPSBcIk1FUkdFX01FU1NBR0VcIiAtPiBudWxsXG4gICAgICAtIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICA9IFwidGVycmFmb3JtLWF3cy11cGRhdGUtZG5zXCIgLT4gbnVsbFxuICAgICAgLSBub2RlX2lkICAgICAgICAgICAgICAgICAgICAgPSBcIlJfa2dET0xSaXNUQVwiIC0+IG51bGxcbiAgICAgIC0gcHJpbWFyeV9sYW5ndWFnZSAgICAgICAgICAgID0gXCJQeXRob25cIiAtPiBudWxsXG4gICAgICAtIHByaXZhdGUgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gcmVwb19pZCAgICAgICAgICAgICAgICAgICAgID0gNzU2NTkxNjkyIC0+IG51bGxcbiAgICAgIC0gc3F1YXNoX21lcmdlX2NvbW1pdF9tZXNzYWdlID0gXCJDT01NSVRfTUVTU0FHRVNcIiAtPiBudWxsXG4gICAgICAtIHNxdWFzaF9tZXJnZV9jb21taXRfdGl0bGUgICA9IFwiQ09NTUlUX09SX1BSX1RJVExFXCIgLT4gbnVsbFxuICAgICAgLSBzc2hfY2xvbmVfdXJsICAgICAgICAgICAgICAgPSBcImdpdEBnaXRodWIuY29tOmluZnJhaG91c2UvdGVycmFmb3JtLWF3cy11cGRhdGUtZG5zLmdpdFwiIC0+IG51bGxcbiAgICAgIC0gc3ZuX3VybCAgICAgICAgICAgICAgICAgICAgID0gXCJodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS90ZXJyYWZvcm0tYXdzLXVwZGF0ZS1kbnNcIiAtPiBudWxsXG4gICAgICAtIHRvcGljcyAgICAgICAgICAgICAgICAgICAgICA9IFtdIC0+IG51bGxcbiAgICAgIC0gdmlzaWJpbGl0eSAgICAgICAgICAgICAgICAgID0gXCJwdWJsaWNcIiAtPiBudWxsXG4gICAgICAtIHZ1bG5lcmFiaWxpdHlfYWxlcnRzICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXVwZGF0ZS1kbnNcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXYgd2lsbCBiZSBkZXN0cm95ZWRcbiAgIyAoYmVjYXVzZSBtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXVwZGF0ZS1kbnNcIl0gaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pXG4gIC0gcmVzb3VyY2UgXCJnaXRodWJfdGVhbV9yZXBvc2l0b3J5XCIgXCJkZXZcIiB7XG4gICAgICAtIGV0YWcgICAgICAgPSBcIlcvXFxcImNmZjg0YTNmNWY0ZTdiN2FiYzgwYmI3YTUwY2E4OTk3MjU0Nzc0MDA2MzFlMjljZWNmMDFhNzc3NWRjM2ExZjFcXFwiXCIgLT4gbnVsbFxuICAgICAgLSBpZCAgICAgICAgID0gXCI3MzMyODE1OnRlcnJhZm9ybS1hd3MtdXBkYXRlLWRuc1wiIC0+IG51bGxcbiAgICAgIC0gcGVybWlzc2lvbiA9IFwicHVzaFwiIC0+IG51bGxcbiAgICAgIC0gcmVwb3NpdG9yeSA9IFwidGVycmFmb3JtLWF3cy11cGRhdGUtZG5zXCIgLT4gbnVsbFxuICAgICAgLSB0ZWFtX2lkICAgID0gXCI3MzMyODE1XCIgLT4gbnVsbFxuICAgIH1cblxuICAjIG1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2RcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdIG11c3QgYmUgcmVwbGFjZWRcbi0vKyByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwic2VjcmV0XCIge1xuICAgICAgfiBjcmVhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDgtMTMgMTk6NDQ6MjEgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBpZCAgICAgICAgICAgICAgPSBcInRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2Q6R0hfVE9LRU5cIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IHBsYWludGV4dF92YWx1ZSA9IChzZW5zaXRpdmUgdmFsdWUpICMgZm9yY2VzIHJlcGxhY2VtZW50XG4gICAgICB+IHVwZGF0ZWRfYXQgICAgICA9IFwiMjAyMy0wOC0xMyAxOTo0NDoyMSArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICMgKDIgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuICAgIH1cblxuICAjIG1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmF3c19pYW1fcG9saWN5LmdpdGh1Yi1hc3N1bWUtYWxsIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcImdpdGh1Yi1hc3N1bWUtYWxsXCIge1xuICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lX3ByZWZpeCA9IFwiaWgtdGYtZ2l0aHViLWNvbnRyb2wtZ2l0aHViLWFzc3VtZS1hbGxcIlxuICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiXG4gICAgICArIHBvbGljeSAgICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gXCJzdHM6QXNzdW1lUm9sZVwiXG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBcIipcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIlxuICAgICAgICAgICAgfVxuICAgICAgICApXG4gICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzICAgICAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieV9tb2R1bGVcIiA9IFwiaW5mcmFob3VzZS9naGEtYWRtaW4vYXdzXCJcbiAgICAgICAgfVxuICAgICAgKyB0YWdzX2FsbCAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICAgICAgICA9IFwiaW5mcmFob3VzZTgvZ2l0aHViLWNvbnRyb2xcIlxuICAgICAgICAgICsgXCJjcmVhdGVkX2J5X21vZHVsZVwiID0gXCJpbmZyYWhvdXNlL2doYS1hZG1pbi9hd3NcIlxuICAgICAgICB9XG4gICAgfVxuXG5QbGFuOiAyOCB0byBhZGQsIDMgdG8gY2hhbmdlLCAzNSB0byBkZXN0cm95LiIsICJzdGRlcnIiOiAiXG5FcnJvcjogR0VUIGh0dHBzOi8vYXBpLmdpdGh1Yi5jb20vcmVwb3MvaW5mcmFob3VzZTgvZ2l0aHViLWNvbnRyb2wvaW52aXRhdGlvbnM/cGVyX3BhZ2U9MTAwOiA0MDMgTXVzdCBoYXZlIGFkbWluIHJpZ2h0cyB0byBSZXBvc2l0b3J5LiBbXVxuXG4gIHdpdGggbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeV9jb2xsYWJvcmF0b3IuY29sbGFib3JhdG9yc1tcImFrdXptaW5za3lcIl0sXG4gIG9uIG1vZHVsZXMvbG9jYWwtcmVwby9yZXBvcy50ZiBsaW5lIDQ3LCBpbiByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5X2NvbGxhYm9yYXRvclwiIFwiY29sbGFib3JhdG9yc1wiOlxuICA0NzogcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeV9jb2xsYWJvcmF0b3JcIiBcImNvbGxhYm9yYXRvcnNcIiB7XG5cbiIsICJhZGQiOiBudWxsLCAiY2hhbmdlIjogbnVsbCwgImRlc3Ryb3kiOiBudWxsfX0=
```
</p></details>